config.org
#+title: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Tips for Use

In this document I've added links in many places that lead you to documentation for the various packages we use.  If you're looking at this file in Emacs, you can put your cursor on a link and press =C-c C-o= or run =M-x org-open-at-point= to open the link in your web browser.

* Package System Setup
** Straight.el setup

#+begin_src emacs-lisp

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

#+end_src

Emacs has a built in package manager but it doesn't make it easy to automatically install packages on a new system the first time you pull down your configuration.  [[https://github.com/jwiegley/use-package][use-package]] is a really helpful package used in this configuration to make it a lot easier to automate the installation and configuration of everything else we use.

#+begin_src emacs-lisp

                                          ; Initialize package sources
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

                                          ; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

#+end_src

** Automatic Package Updates

The auto-package-update package helps us keep our Emacs packages up to date!  It will prompt you after a certain number of days either at startup or at a specific time of day to remind you to update your packages.

You can also use =M-x auto-package-update-now= to update right now!

#+begin_src emacs-lisp

  (use-package auto-package-update
    :custom
    (auto-package-update-hide-results t)
    (auto-package-update-delete-old-versions t))

#+end_src

* Startup Performance

#+begin_src emacs-lisp

                                          ; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 50 1000 1000))

  (defun efs/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                      (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'efs/display-startup-time)

#+end_src

** Runtime Performance

Dial the GC threshold back down so that garbage collection happens more frequently but in less time.

#+begin_src emacs-lisp

                                          ; Make gc pauses faster by decreasing the threshold.
  (setq gc-cons-threshold (* 2 1000 1000))

#+end_src

* Keep Folders Clean

We use the [[https://github.com/emacscollective/no-littering/blob/master/no-littering.el][no-littering]] package to keep folders where we edit files and the Emacs configuration folder clean!  It knows about a wide variety of variables for built in Emacs features as well as those from community packages so it can be much easier than finding and setting these variables yourself.

#+begin_src emacs-lisp

                                          ; NOTE: If you want to move everything out of the (expand-file-name user-emacs-directory) folder
                                          ; reliably, set `user-emacs-directory` before loading no-littering!
                                          ; (setq user-emacs-directory "~/.cache/emacs")


  (when (not (version< emacs-version "26.3"))
    (use-package no-littering))

                                          ; no-littering doesn't set this by default so we must place
                                          ; auto save files in the same path as it uses for sessions
  (when (not (version< emacs-version "26.3"))
    (setq auto-save-file-name-transforms
          `((".*" ,(no-littering-expand-var-file-name "auto-save/") t))))

#+end_src

* Settings

#+begin_src emacs-lisp
                                          ; NOTE: init.el is now generated from config.org.  Please edit that file
                                          ;       in Emacs and init.el will be generated automatically!

                                          ; You will most likely need to adjust this font size for your system!
  (defvar efs/default-font-size 160)
  (defvar efs/default-variable-font-size 160)

                                          ; Make frame transparency overridable
  (defvar efs/frame-transparency '(100 . 100))

  (defvar phd-thesis-dir "~/Documents/GithubProjects/phd-thesis")
  (defvar ta-org-files-dir
    (concat phd-thesis-dir
            "/Documents/Semesters/2023/Spring/TA-CS-357/Org-Files"))
  (defvar maxdiff-org-files-dir
    (concat phd-thesis-dir
            "/Documents/Side-Projects/MaxDiff/Documents/org"))
  (defvar maxdiff-write-ups-dir
    (concat phd-thesis-dir
            "/Documents/Side-Projects/MaxDiff/Documents/notes"))

  (defvar phd-thesis-write-ups-dir
    (concat phd-thesis-dir
            "/Documents/Write-Ups"))
  (defvar phd-thesis-org-files-dir
    (concat phd-thesis-dir
            "/Documents/Org-Files"))

  (defvar scc-dir
    (concat phd-thesis-dir
            "/Documents/Side-Projects/kapur-nsf-proposal"))
  (defvar scc-reports-dir (concat scc-dir "/Reports"))
  (defvar scc-org-files-dir (concat scc-dir "/Org-Files"))

  (defvar seminar-dir
    (concat phd-thesis-dir
            "/Documents/Seminars/BeihangUniversity-Fall2021"))
  (defvar seminar-org-files-dir (concat seminar-dir "/Org-Files"))
  (defvar ta-tasks-mail
    (concat ta-org-files-dir "/current_tasks.org"))

  (defvar maxdiff-agenda-mail
    (concat maxdiff-org-files-dir "/agenda.org"))

  (defvar research-tasks-mail
    (concat phd-thesis-org-files-dir "/research_tasks.org"))
  (defvar lunch-tasks-mail
    (concat phd-thesis-org-files-dir "/lunch_tasks.org"))
  (defvar side-tasks-mail
    (concat phd-thesis-org-files-dir "/side_tasks.org"))
  (defvar scc-tasks-mail
    (concat scc-org-files-dir "/scc_tasks.org"))
  (defvar school-tasks-mail
    (concat phd-thesis-org-files-dir "/school_tasks.org"))
  (defvar seminar-tasks-mail
    (concat seminar-org-files-dir "/seminar_tasks.org"))
  (defvar seminar-meetings
    (concat seminar-org-files-dir "/meeting_notes.org"))
#+end_src

* Basic UI Configuration

This section configures basic UI settings that remove unneeded elements to make Emacs look a lot more minimal and modern.  If you're just getting started in Emacs, the menu bar might be helpful so you can remove the =(menu-bar-mode -1)= line if you'd like to still see that.

#+begin_src emacs-lisp

  (setq inhibit-startup-message t)

  (scroll-bar-mode -1)               ; Disable visible scrollbar
  (tool-bar-mode -1)                 ; Disable the toolbar
  (tooltip-mode -1)                  ; Disable tooltips
  (set-fringe-mode 10)               ; Give some breathing room

  (menu-bar-mode -1)                 ; Disable the menu bar
  (winner-mode 1)                    ; Enable winner mode
  (setq winner-dont-bind-my-keys t)

  (server-start)                     ; Start server
  (setq process-connection-type nil) ; Use pipes
  (setq history-length 25)
  (savehist-mode 1)
  (save-place-mode 1)
  (setq use-dialog-box nil)

  (setq ring-bell-function 'ignore)

  (column-number-mode)
  (setq-default display-line-numbers-type 'visual)
  (when (not (version< emacs-version "26.3"))
    (global-display-line-numbers-mode t))

                                          ; Set frame transparency
  (set-frame-parameter (selected-frame) 'alpha efs/frame-transparency)
  (add-to-list 'default-frame-alist `(alpha . ,efs/frame-transparency))
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

                                          ; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  vterm-mode-hook
                  markdown-mode-hook
                  mu4e-headers-mode-hook
                  mu4e-view-mode-hook
                  mu4e-main-mode-hook
                  mu4e-org-mode-hook
                  mu4e-compose-mode-hook
                  treemacs-mode-hook
                  TeX-mode-hook
                  LaTeX-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  (add-to-list 'auto-mode-alist '("\\.dat\\'" . text-mode))
  (add-to-list 'auto-mode-alist '("\\.dat-s\\'" . text-mode))

#+end_src

