init.el

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

                                        ; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

(use-package auto-package-update
  :custom
  (auto-package-update-hide-results t)
  (auto-package-update-delete-old-versions t))

; The default is 800 kilobytes.  Measured in bytes.
(setq gc-cons-threshold (* 50 1000 1000))

(defun efs/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                    (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'efs/display-startup-time)

; Make gc pauses faster by decreasing the threshold.
(setq gc-cons-threshold (* 2 1000 1000))

; NOTE: If you want to move everything out of the (expand-file-name user-emacs-directory) folder
                                        ; reliably, set `user-emacs-directory` before loading no-littering!
                                        ; (setq user-emacs-directory "~/.cache/emacs")


(when (not (version< emacs-version "26.3"))
  (use-package no-littering))

                                        ; no-littering doesn't set this by default so we must place
                                        ; auto save files in the same path as it uses for sessions
(when (not (version< emacs-version "26.3"))
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t))))

; NOTE: init.el is now generated from config.org.  Please edit that file
                                        ;       in Emacs and init.el will be generated automatically!

                                        ; You will most likely need to adjust this font size for your system!
(defvar efs/default-font-size 160)
(defvar efs/default-variable-font-size 160)

                                        ; Make frame transparency overridable
(defvar efs/frame-transparency '(100 . 100))

(defvar phd-thesis-dir "~/Documents/GithubProjects/phd-thesis")
(defvar ta-org-files-dir
  (concat phd-thesis-dir
          "/Documents/Semesters/2023/Spring/TA-CS-357/Org-Files"))
(defvar maxdiff-org-files-dir
  (concat phd-thesis-dir
          "/Documents/Side-Projects/MaxDiff/Documents/org"))
(defvar maxdiff-write-ups-dir
  (concat phd-thesis-dir
          "/Documents/Side-Projects/MaxDiff/Documents/notes"))

(defvar phd-thesis-write-ups-dir
  (concat phd-thesis-dir
          "/Documents/Write-Ups"))
(defvar phd-thesis-org-files-dir
  (concat phd-thesis-dir
          "/Documents/Org-Files"))

(defvar scc-dir
  (concat phd-thesis-dir
          "/Documents/Side-Projects/kapur-nsf-proposal"))
(defvar scc-reports-dir (concat scc-dir "/Reports"))
(defvar scc-org-files-dir (concat scc-dir "/Org-Files"))

(defvar seminar-dir
  (concat phd-thesis-dir
          "/Documents/Seminars/BeihangUniversity-Fall2021"))
(defvar seminar-org-files-dir (concat seminar-dir "/Org-Files"))
(defvar ta-tasks-mail
  (concat ta-org-files-dir "/current_tasks.org"))

(defvar maxdiff-agenda-mail
  (concat maxdiff-org-files-dir "/agenda.org"))

(defvar research-tasks-mail
  (concat phd-thesis-org-files-dir "/research_tasks.org"))
(defvar lunch-tasks-mail
  (concat phd-thesis-org-files-dir "/lunch_tasks.org"))
(defvar side-tasks-mail
  (concat phd-thesis-org-files-dir "/side_tasks.org"))
(defvar scc-tasks-mail
  (concat scc-org-files-dir "/scc_tasks.org"))
(defvar school-tasks-mail
  (concat phd-thesis-org-files-dir "/school_tasks.org"))
(defvar seminar-tasks-mail
  (concat seminar-org-files-dir "/seminar_tasks.org"))
(defvar seminar-meetings
  (concat seminar-org-files-dir "/meeting_notes.org"))

(setq inhibit-startup-message t)

(scroll-bar-mode -1)               ; Disable visible scrollbar
(tool-bar-mode -1)                 ; Disable the toolbar
(tooltip-mode -1)                  ; Disable tooltips
(set-fringe-mode 10)               ; Give some breathing room

(menu-bar-mode -1)                 ; Disable the menu bar
(winner-mode 1)                    ; Enable winner mode
(setq winner-dont-bind-my-keys t)

(server-start)                     ; Start server
(setq process-connection-type nil) ; Use pipes
(setq history-length 25)
(savehist-mode 1)
(save-place-mode 1)
(setq use-dialog-box nil)

(setq ring-bell-function 'ignore)

(column-number-mode)
(setq-default display-line-numbers-type 'visual)
(when (not (version< emacs-version "26.3"))
  (global-display-line-numbers-mode t))

                                        ; Set frame transparency
(set-frame-parameter (selected-frame) 'alpha efs/frame-transparency)
(add-to-list 'default-frame-alist `(alpha . ,efs/frame-transparency))
(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))

                                        ; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                vterm-mode-hook
                markdown-mode-hook
                mu4e-headers-mode-hook
                mu4e-view-mode-hook
                mu4e-main-mode-hook
                mu4e-org-mode-hook
                mu4e-compose-mode-hook
                treemacs-mode-hook
                TeX-mode-hook
                LaTeX-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(add-to-list 'auto-mode-alist '("\\.dat\\'" . text-mode))
(add-to-list 'auto-mode-alist '("\\.dat-s\\'" . text-mode))
