init.el

(defvar dashboard-logo-path "~/Pictures/Wallpapers/figures/480px-EmacsIcon.svg.png")

(use-package all-the-icons)

(when (not (version< emacs-version "26.1"))
  (use-package dashboard
    :ensure t
    :config
                                        ;(setq dashboard-center-content t)
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-set-navigator t)
    (setq dashboard-banner-logo-title "Welcome to Emacs!")
    (when (file-exists-p dashboard-logo-path)
      (setq dashboard-startup-banner dashboard-logo-path))
    (setq dashboard-items '((recents  . 10)
                            (bookmarks . 10)
                            (projects . 5)))
    (dashboard-setup-startup-hook)))

(setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))

(defun frame-font-setup
    (&rest ...)
  ;; (remove-hook 'focus-in-hook #'frame-font-setup)
  (unless (assoc 'font default-frame-alist)
    (let* ((font-family (catch 'break
                          (dolist (font-family
                                   '("Fira Code"
                                     "Hack"
                                     "Consolas"))
                            (when (member font-family (font-family-list))
                              (throw 'break font-family)))))
           (font (when font-family (format "%s-18" font-family))))
      (when font
        (add-to-list 'default-frame-alist (cons 'font font))
        (set-frame-font font t t)))))

(add-hook 'focus-in-hook #'frame-font-setup)

; Make ESC quit prompts
(defun persp-exit ()
  (interactive)
  (prog1 (persp-state-save "~/.config/jose-emacs/.emacs-session") (save-buffers-kill-terminal)))

(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
(global-set-key [(control x) (k)] 'kill-buffer)

(use-package general
  :after evil
  :config
  (general-create-definer efs/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")

  (efs/leader-keys
    "o" '(:ignore t :which-key "(o)rg")
    "oc" '(org-capture nil :which-key "org-(c)apture")
    "b" '(:ignore t :which-key "edit (b)uffer")
    "bc"  '(evilnc-comment-or-uncomment-lines :which-key "(c)omment line")
    "bf"  '(fill-buffer :which-key "(f)ill buffer")
    "bi"  '((lambda () (interactive)
              (indent-region (point-min) (point-max)))
            :which-key "(i)ndent buffer")
    "by" '(simpleclip-copy :which-key "clipboard (y)ank")
    "bp" '(simpleclip-paste :which-key "clipboard (p)aste")
    "f" '(:ignore t :which-key "edit (f)iles")
    "fa" '((lambda () (interactive)
             (find-file
              (expand-file-name (concat phd-thesis-org-files-dir "/main.org"))))
           :which-key "(a)genda")
    "fe" '((lambda () (interactive)
             (find-file
              (expand-file-name "config.org" user-emacs-directory)))
           :which-key "(e)macs source")
    "fw" '((lambda () (interactive)
             (find-file
              (expand-file-name
               (concat seminar-dir
                       "/Reports/finding_certificates_qm_univariate/main.tex"))))
           :which-key "Current (w)ork")
    "fr" '(:ignore t :which-key "Edit (r)eferences")
    "frp" '((lambda () (interactive)
              (find-file
               (expand-file-name (concat phd-thesis-write-ups-dir "/references.bib"))))
            :which-key "Edit (p)hD references")
    "frs" '((lambda () (interactive)
              (find-file
               (expand-file-name (concat scc-reports-dir "/references.bib"))))
            :which-key "Edit (s)CC references")
    "p" '(:ignore t :which-key "Presentation")
    "pp" '(org-tree-slide-move-previous-tree :which-key "Previous slide")
    "pn" '(org-tree-slide-move-next-tree  :which-key "Next slide")
    "s"  '(shell-command :which-key "(s)hell command")
    "t"  '(:ignore t :which-key "(t)oggles")
    "tt" '(load-theme :which-key "Choose (t)heme")
    "g" '(magit-status :which-key "Ma(g)it status")
    "d" '(dired-jump :which-key "(d)ired jump")
    "m" '(mu4e :which-key "(m)u4e")
    "l" '(:ignore t :which-key "(l)atex related")
    "lp" '((lambda () (interactive)
             (yasnippet/goto-parent-file))
           :which-key "Goto (p)arent")
    "lF" '((lambda () (interactive)
             (LaTeX-fill-buffer nil))
           :which-key "Latex (F)ill buffer")
    "lf" '((lambda () (interactive)
             (lsp-latex-forward-search))
           :which-key "Latex (f)orward search")
    "w" '(:ignore t :which-key "(w)indows related")
    "wu" '(winner-undo :which-key "Winner (u)ndo")
    "wr" '(winner-redo :which-key "Winner (r)edo")))

(use-package better-jumper
  :after evil
  :config
  (better-jumper-mode +1)
  (define-key evil-motion-state-map (kbd "C-i")
    'better-jumper-jump-forward)
  (define-key evil-motion-state-map (kbd "C-o")
    'better-jumper-jump-backward))

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g")
    'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h")
    'evil-delete-backward-char-and-join)
                                        ; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(when (not (version< emacs-version "26.3"))
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init)
    (setq forge-add-default-bindings nil)))

(use-package evil-numbers
  :after evil
  :config
  (define-key evil-normal-state-map (kbd "C-c +") 'evil-numbers/inc-at-pt)
  (define-key evil-normal-state-map (kbd "C-c -") 'evil-numbers/dec-at-pt))

(use-package command-log-mode
  :commands command-log-mode)

(use-package doom-themes
  :init (load-theme 'doom-gruvbox t))

(use-package anzu)

(use-package evil-anzu
  :after evil
  :config (global-anzu-mode 1)
  (setq anzu-minimum-input-length 4))

(when (not (version< emacs-version "26.3"))
  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom (
             (doom-modeline-height 15)
             (doom-modeline-enable-word-count t)
             (doom-modeline-continuous-word-count-modes '(markdown-mode gfm-mode org-mode text-mode)))))
