init.el

;; (setq-default mode-line-format '("%e"
;;                                  (:eval
;;                                   (if (equal
;;                                        (shell-command-to-string
;;                                         "ps aux | grep 'mbsync -a' | wc -l | xargs")
;;                                        "3\n")
;;                                       " Running mbsync " " "))
;;                                  "%e" (:eval
;;                                        (when (display-graphic-p) (shell-command-to-string
;;                                                                   "~/.local/scripts/check_email.sh")))
;;                                  (:eval (doom-modeline-format--main))))

(use-package which-key
  :defer 0
  :diminish which-key-mode
  :config
  (which-key-mode)
  (setq which-key-idle-delay 1))

(use-package flx)

(when (not (version< emacs-version "27.1"))
  (use-package marginalia
    ;; Either bind `marginalia-cycle` globally or only in the minibuffer
    :bind (("M-A" . marginalia-cycle)
           :map minibuffer-local-map
           ("M-A" . marginalia-cycle))

    ;; The :init configuration is always executed (Not lazy!)
    :init

    ;; Must be in the :init section of use-package such that the mode gets
    ;; enabled right away. Note that this forces loading the package.
    (marginalia-mode)))

(when (not (version< emacs-version "26.1"))
  (use-package embark
    :ensure t
    :bind
    (("C-." . embark-act)         ;; pick some comfortable binding
     ("C-;" . embark-dwim)        ;; good alternative: M-.
     ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'
    :init
    ;; Optionally replace the key help with a completing-read interface
    (setq prefix-help-command #'embark-prefix-help-command)
    :config
    ;; Hide the mode line of the Embark live/completions buffers
    (require 'embark)
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none))))))

                                        ; Consult users will also want the embark-consult package.
(when (not (version< emacs-version "27.1"))
  (use-package embark-consult
    :ensure t ; only need to install it, embark loads it after consult if found
    :after (embark consult)
    :demand t
    :hook
    (embark-collect-mode . consult-preview-at-point-mode)
    :init
    (with-eval-after-load 'embark
      (require 'embark-consult))))

(when (not (version< emacs-version "27.1"))
  (use-package vertico
    :bind (:map vertico-map
                ("RET" . vertico-directory-enter)
                ("DEL" . vertico-directory-delete-char)
                ("C-h" . vertico-directory-delete-word))
    :init
    (vertico-mode)))

(when (not (version< emacs-version "26.1"))
  (use-package orderless
    :demand t
    :init
    ;; Configure a custom style dispatcher (see the Consult wiki)
    ;; (setq orderless-style-dispatchers '(+orderless-dispatch)
    ;;       orderless-component-separator #'orderless-escapable-split-on-space)
    (setq completion-styles '(basic substring partial-completion orderless)
          completion-category-defaults nil
          completion-category-overrides '((file (styles partial-completion))))
    :config
    (setq orderless-matching-styles '(orderless-flex))))

(when (not (version< emacs-version "26.3"))
