config.org
** Configure Babel Languages

To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like to use.  [[https://orgmode.org/worg/org-contrib/babel/languages.html][This page]] documents all of the languages that you can use with =org-babel=.

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)))

    (push '("conf-unix" . conf-unix) org-src-lang-modes))

#+end_src

This section contains the basic configuration for =org-mode= plus the configuration for Org agendas and capture templates.  There's a lot to unpack in here so I'd recommend watching the videos for [[https://youtu.be/VcgjTEa0kU4][Part 5]] and [[https://youtu.be/PNE-mgkZ6HM][Part 6]] for a full explanation.

#+begin_src emacs-lisp

  (defun efs/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

  (use-package org
    :pin org
    :commands (org-capture org-agenda)
    :hook (org-mode . efs/org-mode-setup)
    :config
    (setq org-file-apps
          '((auto-mode . emacs)
            (directory . emacs)
            ("\\.mm\\'" . default)
            ("\\.x?html?\\'" . default)
            ("\\.nb?\\'" . "Mathematica %s")
            ("\\.pdf\\'" . "zathura %s")))

    (setq org-ellipsis "⇓")

    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    (require 'org-habit)
    (require 'org-protocol)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60)

    (setq org-todo-keywords
          '((sequence "EXTERNAL" "|")
            (sequence "GOAL" "IDEA" "OBSERVATION" "|" "OK")
            (sequence "TODAY" "LATER" "|")
            (sequence "TODO" "|" "COMPLETED(c)" "CANC(k@)")
            (sequence "EMAIL" "|")))

                                          ; Save Org buffers after refiling!
    (advice-add 'org-refile :after 'org-save-all-org-buffers)

                                          ; Use find-file instead of file-find-other-window
    (setf (cdr (assoc 'file org-link-frame-setup)) 'find-file)

    (setq org-tag-alist
          '((:startgroup)
                                          ; Put mutually exclusive tags here
            (:endgroup)
            ("@errand" . ?E)
            ("@home" . ?H)
            ("@work" . ?W)
            ("agenda" . ?a)
            ("planning" . ?p)
            ("publish" . ?P)
            ("batch" . ?b)
            ("note" . ?n)
            ("idea" . ?i)))

    (setq org-capture-templates
          `(
            ("e" "Email Capture")
            ("er" "Research Tasks" entry
             (file+olp research-tasks-mail "EMAIL")
             "** TODO Check this email %a"
             :immediate-finish t)
            ("el" "Lunch Tasks" entry
             (file+olp lunch-tasks-mail "EMAIL")
             "** TODO Check this email %a"
             :immediate-finish t)
            ("es" "S..")
            ("esc" "School Tasks" entry
             (file+olp school-tasks-mail "EMAIL")
             "** TODO Check this email %a"
             :immediate-finish t)
            ("est" "Seminar Tasks" entry
             (file+olp seminar-tasks-mail "EMAIL")
             "** TODO Check this email %a"
             :immediate-finish t)
            ("esm" "Seminar Meetings" plain
             (file+function seminar-meetings (lambda () (goto-line 5)))
             "%a"
             :prepend t
             :immediate-finish t)
            ("et" "TA Tasks" entry
             (file+olp ta-tasks-mail "EMAIL")
             "** TODO Check this email %a"
             :immediate-finish t)
            ("em" "MaxDiff Agenda" entry
             (file+olp maxdiff-agenda-mail "EMAIL")
             "** TODO Check this email %a"
             :immediate-finish t)
            )
          )

    (define-key org-mode-map (kbd "C-c c")
      (lambda () (interactive) (org-todo "COMPLETED")))
    (define-key org-mode-map (kbd "C-c t")
      (lambda () (interactive) (org-todo "TODO")))
    (define-key org-mode-map (kbd "C-c i")
      (lambda () (interactive) (org-todo "IDEA")))
    (define-key org-mode-map (kbd "C-c o")
      (lambda () (interactive) (org-todo "OK")))
    (define-key org-mode-map (kbd "C-c C-<return>")
      'org-meta-return)
    (define-key org-mode-map (kbd "C-c RET")
      'org-meta-return)
    (define-key org-mode-map (kbd "C-c s")
      (lambda () (interactive) (org-sort-buffer)))

    (efs/org-font-setup))

  (defun org-sort-buffer ()
    "Sort all entries in the current buffer, recursively."
    (interactive)
    (mark-whole-buffer)
    (org-sort-entries nil ?o)
    (org-map-entries (lambda ()
                       (condition-case x
                           (org-sort-entries nil ?o)
                         (user-error)))))
#+end_src

Update org-latex-classes

#+begin_src emacs-lisp

  (unless (boundp 'org-latex-classes)
    (setq org-latex-classes nil))

  (add-to-list 'org-latex-classes
               '("myarticle"
                 "\\documentclass{article}
                    [NO-DEFAULT-PACKAGES]
                   \\usepackage{symbols}"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

  (add-to-list 'org-latex-classes
               '("myreport"
                 "\\documentclass[peerreview]{IEEEtran}
                    [NO-DEFAULT-PACKAGES]
                   \\usepackage{symbols}"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

#+end_src

*** Org roam

#+begin_src emacs-lisp
  (use-package org-roam
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory "~/Documents/GithubProjects/phd-thesis/Documents/Misc")
    (org-roam-capture-templates
     '(("d" "default" plain
        "%?"
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+TITLE: ${title}\n")
        :unnarrowed t)
       ("l" "lecture" plain
        (file "~/Documents/GithubProjects/phd-thesis/Documents/Misc/Templates/lecture.org")
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+TITLE: ${title}\n")
        :unnarrowed t)
       ("m" "meeting" plain
        (file "~/Documents/GithubProjects/phd-thesis/Documents/Misc/Templates/meeting.org")
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+TITLE: ${title}\n")
        :unnarrowed t)))
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n i" . org-roam-node-insert))
    :config
    (org-roam-setup))
#+end_src

*** Ox Hugo

#+begin_src emacs-lisp

  (when (not (version< emacs-version "26.3"))
    (use-package ox-hugo
      :ensure t
      :pin melpa
      :after ox))

#+end_src

*** Nicer Heading Bullets

[[https://github.com/sabof/org-bullets][org-bullets]] replaces the heading stars in =org-mode= buffers with nicer looking characters that you can control.  Another option for this is [[https://github.com/integral-dw/org-superstar-mode][org-superstar-mode]] which we may cover in a later video.

#+begin_src emacs-lisp

  (use-package org-bullets
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

*** Center Org Buffers

We use [[https://github.com/joostkremers/visual-fill-column][visual-fill-column]] to center =org-mode= buffers for a more pleasing writing experience as it centers the contents of the buffer horizontally to seem more like you are editing a document.  This is really a matter of personal preference so you can remove the block below if you don't like the behavior.

#+begin_src emacs-lisp

  (defun fill-buffer ()
    (interactive)
    (save-excursion
      (save-restriction
        (widen)
        (fill-region (point-min) (point-max)))))

  (defun efs/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook ((org-mode . efs/org-mode-visual-fill)
           (markdown-mode . efs/org-mode-visual-fill)
           (TeX-mode . efs/org-mode-visual-fill)
           (LaTeX-mode . efs/org-mode-visual-fill)
           (mu4e-main-mode . efs/org-mode-visual-fill)))

#+end_src

** Auto-tangle Configuration Files

This snippet adds a hook to =org-mode= buffers so that =efs/org-babel-tangle-config= gets executed each time such a buffer gets saved.  This function checks to see if the file being saved is the config.org file you're looking at right now, and if so, automatically exports the configuration here to the associated output files.

#+begin_src emacs-lisp

                                          ; Automatically tangle our config.org config file when we save it
  (defun efs/org-babel-tangle-config ()
    (when (string-equal (file-name-directory (buffer-file-name))
                        (expand-file-name user-emacs-directory))
                                          ; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))

#+end_src

* Development
