init.el
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes))

(defun efs/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))

(use-package org
  :pin org
  :commands (org-capture org-agenda)
  :hook (org-mode . efs/org-mode-setup)
  :config
  (setq org-file-apps
        '((auto-mode . emacs)
          (directory . emacs)
          ("\\.mm\\'" . default)
          ("\\.x?html?\\'" . default)
          ("\\.nb?\\'" . "Mathematica %s")
          ("\\.pdf\\'" . "zathura %s")))

  (setq org-ellipsis "⇓")

  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)

  (require 'org-habit)
  (require 'org-protocol)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60)

  (setq org-todo-keywords
        '((sequence "EXTERNAL" "|")
          (sequence "GOAL" "IDEA" "OBSERVATION" "|")
          (sequence "TODAY" "TODO" "LATER" "|" "COMPLETED(c)" "CANC(k@)")
          (sequence "EMAIL" "|")))

                                        ; Save Org buffers after refiling!
  (advice-add 'org-refile :after 'org-save-all-org-buffers)

                                        ; Use find-file instead of file-find-other-window
  (setf (cdr (assoc 'file org-link-frame-setup)) 'find-file)

  (setq org-tag-alist
        '((:startgroup)
                                        ; Put mutually exclusive tags here
          (:endgroup)
          ("@errand" . ?E)
          ("@home" . ?H)
          ("@work" . ?W)
          ("agenda" . ?a)
          ("planning" . ?p)
          ("publish" . ?P)
          ("batch" . ?b)
          ("note" . ?n)
          ("idea" . ?i)))

  (setq org-capture-templates
        `(
          ("e" "Email Capture")
          ("er" "Research Tasks" entry
           (file+olp research-tasks-mail "EMAIL")
           "** TODO Check this email %a"
           :immediate-finish t)
          ("el" "Lunch Tasks" entry
           (file+olp lunch-tasks-mail "EMAIL")
           "** TODO Check this email %a"
           :immediate-finish t)
          ("es" "S..")
          ("esc" "School Tasks" entry
           (file+olp school-tasks-mail "EMAIL")
           "** TODO Check this email %a"
           :immediate-finish t)
          ("est" "Seminar Tasks" entry
           (file+olp seminar-tasks-mail "EMAIL")
           "** TODO Check this email %a"
           :immediate-finish t)
          ("esm" "Seminar Meetings" plain
           (file+function seminar-meetings (lambda () (goto-line 5)))
           "%a"
           :prepend t
           :immediate-finish t)
          ("et" "TA Tasks" entry
           (file+olp ta-tasks-mail "EMAIL")
           "** TODO Check this email %a"
           :immediate-finish t)
          ("em" "MaxDiff Agenda" entry
           (file+olp maxdiff-agenda-mail "EMAIL")
           "** TODO Check this email %a"
           :immediate-finish t)
          )
        )

  (define-key org-mode-map (kbd "C-c c")
    (lambda () (interactive) (org-todo "COMPLETED")))

  (define-key org-mode-map (kbd "C-c t")
    (lambda () (interactive) (org-todo "TODO")))

  (define-key org-mode-map (kbd "C-c C-RET")
    (lambda () (interactive) (org-meta-return)))

  (define-key org-mode-map (kbd "C-c s")
    (lambda () (interactive) (org-sort-buffer)))

  (efs/org-font-setup))

(defun org-sort-buffer ()
  "Sort all entries in the current buffer, recursively."
  (interactive)
  (mark-whole-buffer)
  (org-sort-entries nil ?o)
  (org-map-entries (lambda ()
                     (condition-case x
                         (org-sort-entries nil ?o)
                       (user-error)))))

(unless (boundp 'org-latex-classes)
  (setq org-latex-classes nil))

(add-to-list 'org-latex-classes
             '("myarticle"
               "\\documentclass{article}
                  [NO-DEFAULT-PACKAGES]
                 \\usepackage{symbols}"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

(add-to-list 'org-latex-classes
             '("myreport"
               "\\documentclass[peerreview]{IEEEtran}
                  [NO-DEFAULT-PACKAGES]
                 \\usepackage{symbols}"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

(when (not (version< emacs-version "26.3"))
  (use-package ox-hugo
    :ensure t
    :pin melpa
    :after ox))

(use-package org-bullets
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

(defun fill-buffer ()
  (interactive)
  (save-excursion
    (save-restriction
      (widen)
      (fill-region (point-min) (point-max)))))

(defun efs/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook ((org-mode . efs/org-mode-visual-fill)
         (markdown-mode . efs/org-mode-visual-fill)
         (TeX-mode . efs/org-mode-visual-fill)
         (LaTeX-mode . efs/org-mode-visual-fill)
         (mu4e-main-mode . efs/org-mode-visual-fill)))

; Automatically tangle our config.org config file when we save it
(defun efs/org-babel-tangle-config ()
  (when (string-equal (file-name-directory (buffer-file-name))
                      (expand-file-name user-emacs-directory))
                                        ; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
