config.org
** Projectile

[[https://projectile.mx/][Projectile]] is a project management library for Emacs which makes it a lot easier to navigate around code projects for various languages.  Many packages integrate with Projectile so it's a good idea to have it installed even if you don't use its commands directly.

#+begin_src emacs-lisp

  (use-package projectile
    :after orderless
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'orderless))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
                                          ; NOTE: Set this to the folder where you keep your Git repos!
    (when (file-directory-p "~/Documents/GithubProjects")
      (setq projectile-project-search-path '("~/Documents/GithubProjects")))
    (setq projectile-switch-project-action #'projectile-dired))

#+end_src

** Yasnippet setup

#+begin_src emacs-lisp

  (use-package yasnippet
    :config
    (setq yas-snippet-dirs `(,(expand-file-name "snippets" user-emacs-directory)))
    (setq yas-key-syntaxes '(yas-longest-key-from-whitespace "w_.()" "w_." "w_" "w"))
    (yas-global-mode 1))

  (use-package yasnippet-snippets)

  (load (expand-file-name "snippets/yasnippet-scripts.el" user-emacs-directory))

#+end_src

** Perspective

#+begin_src emacs-lisp

  (use-package perspective
    :ensure t
    :bind (("C-x k" . persp-kill-buffer*)
           ("C-x C-b" . consult-buffer))
    :custom
    (persp-mode-prefix-key (kbd "M-p"))
    :init
    (persp-mode))

#+end_src

** Avy

#+begin_src emacs-lisp

  (use-package avy
    :config
    (setq avy-all-windows 'all-frames)
    (global-set-key (kbd "C-:") 'avy-goto-char))

#+end_src

** Languages

*** IDE Features with lsp-mode

**** lsp-mode

We use the excellent [[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] to enable IDE-like functionality for many different programming languages via "language servers" that speak the [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]].  Before trying to set up =lsp-mode= for a particular language, check out the [[https://emacs-lsp.github.io/lsp-mode/page/languages/][documentation for your language]] so that you can learn which language servers are available and how to install them.

The =lsp-keymap-prefix= setting enables you to define a prefix for where =lsp-mode='s default keybindings will be added.  I *highly recommend* using the prefix to find out what you can do with =lsp-mode= in a buffer.

The =which-key= integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing =C-c l= in a =lsp-mode= buffer and trying different things that you find there.

#+begin_src emacs-lisp

  (defun efs/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (when (not (version< emacs-version "26.1"))
    (use-package lsp-mode
      :commands (lsp lsp-deferred)
      :hook (lsp-mode . efs/lsp-mode-setup)
      :init
      (setq lsp-keymap-prefix "C-l")
      :config
      (lsp-enable-which-key-integration t)))

#+end_src

**** lsp-ui

[[https://emacs-lsp.github.io/lsp-ui/][lsp-ui]] is a set of UI enhancements built on top of =lsp-mode= which make Emacs feel even more like an IDE.  Check out the screenshots on the =lsp-ui= homepage (linked at the beginning of this paragraph) to see examples of what it can do.

#+begin_src emacs-lisp

  (when (not (version< emacs-version "26.1"))
    (use-package lsp-ui
      :hook (lsp-mode . lsp-ui-mode)
      :custom
      (lsp-ui-doc-position 'bottom)))

#+end_src

**** tree-sitter

#+begin_src emacs-lisp

                                          ; :hook (
                                          ; (org-mode TeX-mode LaTeX-mode typescript-mode
                                          ; maplev-mode c-mode c++-mode python-mode rustic-mode)
                                          ;. tree-sitter-hl-mode))

  (when (fboundp 'module-load)
    (use-package tree-sitter
      :straight (tree-sitter :type git
                             :host github
                             :repo "ubolonton/emacs-tree-sitter"
                             :files ("lisp/*.el"))
      :hook ((latex-mode python-mode rustic-mode) . tree-sitter-hl-mode)
      :config
      (add-to-list 'tree-sitter-major-mode-language-alist '(rustic-mode . rust))
      (add-to-list 'tree-sitter-major-mode-language-alist '(TeX-mode . latex))
      (add-to-list 'tree-sitter-major-mode-language-alist '(LaTeX-mode . latex))
      (add-to-list 'tree-sitter-major-mode-language-alist '(latex-mode . latex))
      (add-to-list 'tree-sitter-major-mode-language-alist '(bibtex-mode . bibtex))
      (add-to-list 'tree-sitter-major-mode-language-alist '(org-mode . org))
      (add-to-list 'tree-sitter-major-mode-language-alist '(c-mode . c))
      (add-to-list 'tree-sitter-major-mode-language-alist '(cpp-mode . cpp))
      (add-to-list 'tree-sitter-major-mode-language-alist '(python-mode . python))
      (add-to-list 'tree-sitter-major-mode-language-alist '(typescript-mode . typescript))))

  (when (fboundp 'module-load)
    (use-package tree-sitter-langs
      :straight (tree-sitter-langs :type git
                                   :host github
                                   :repo "ubolonton/emacs-tree-sitter"
                                   :files ("langs/*.el" "langs/queries"))
      :after tree-sitter))

#+end_src

**** treemacs

#+begin_src emacs-lisp

  (when (not (version< emacs-version "26.1"))
    (use-package treemacs
      :bind
      (:map global-map
            ([f4] . treemacs)
            ([f5] . treemacs-select-window))
      :config
      (setq treemacs-is-never-other-window t)))

#+end_src

**** treemacs-evil

#+begin_src emacs-lisp

  (when (not (version< emacs-version "26.1"))
    (use-package treemacs-evil
      :after treemacs evil))

#+end_src

**** lsp-treemacs

[[https://github.com/emacs-lsp/lsp-treemacs][lsp-treemacs]] provides nice tree views for different aspects of your code like symbols in a file, references of a symbol, or diagnostic messages (errors and warnings) that are found in your code.

Try these commands with =M-x=:

- =lsp-treemacs-symbols= - Show a tree view of the symbols in the current file
- =lsp-treemacs-references= - Show a tree view for the references of the symbol under the cursor
- =lsp-treemacs-error-list= - Show a tree view for the diagnostic messages in the project

  This package is built on the [[https://github.com/Alexander-Miller/treemacs][treemacs]] package which might be of some interest to you if you like to have a file browser at the left side of your screen in your editor.

  #+begin_src emacs-lisp

    (when (not (version< emacs-version "26.1"))
      (use-package lsp-treemacs
        :after lsp))

  #+end_src

*** Debugging with dap-mode

[[https://emacs-lsp.github.io/dap-mode/][dap-mode]] is an excellent package for bringing rich debugging capabilities to Emacs via the [[https://microsoft.github.io/debug-adapter-protocol/][Debug Adapter Protocol]].  You should check out the [[https://emacs-lsp.github.io/dap-mode/page/configuration/][configuration docs]] to learn how to configure the debugger for your language.  Also make sure to check out the documentation for the debug adapter to see what configuration parameters are available to use for your debug templates!

#+begin_src emacs-lisp

  (when (not (version< emacs-version "26.1"))
    (use-package dap-mode
                                          ; Uncomment the config below if you want all UI panes to be hidden by default!
                                          ; :custom
                                          ; (lsp-enable-dap-auto-configure nil)
                                          ; :config
                                          ; (dap-ui-mode 1)
      :commands dap-debug
      :config
                                          ; Set up Node debugging
      (require 'dap-node)
      (dap-node-setup) ; Automatically installs Node debug adapter if needed

                                          ; Bind `C-c l d` to `dap-hydra` for easy access
      (general-define-key
       :keymaps 'lsp-mode-map
       :prefix lsp-keymap-prefix
       "d" '(dap-hydra t :wk "debugger"))))

#+end_src

*** TypeScript

This is a basic configuration for the TypeScript language so that =.ts= files activate =typescript-mode= when opened.  We're also adding a hook to =typescript-mode-hook= to call =lsp-deferred= so that we activate =lsp-mode= to get LSP features every time we edit TypeScript code.

#+begin_src emacs-lisp

  (use-package typescript-mode
    :mode "\\.ts\\'"
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2))

#+end_src

*Important note!*  For =lsp-mode= to work with TypeScript (and JavaScript) you will need to install a language server on your machine.  If you have Node.js installed, the easiest way to do that is by running the following command:

#+begin_src shell :tangle no

  npm install -g typescript-language-server typescript

#+end_src

This will install the [[https://github.com/theia-ide/typescript-language-server][typescript-language-server]] and the TypeScript compiler package.

*** Rust

#+begin_src emacs-lisp

  (use-package rustic
    :straight t)

#+end_src

*** C/C++

#+begin_src emacs-lisp

  (add-hook 'c-mode-hook 'lsp)
  (add-hook 'c++-mode-hook 'lsp)

#+end_src

