init.el

(use-package projectile
  :after orderless
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'orderless))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
                                        ; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/Documents/GithubProjects")
    (setq projectile-project-search-path '("~/Documents/GithubProjects")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package yasnippet
  :config
  (setq yas-snippet-dirs `(,(expand-file-name "snippets" user-emacs-directory)))
  (setq yas-key-syntaxes '(yas-longest-key-from-whitespace "w_.()" "w_." "w_" "w"))
  (define-key yas-minor-mode-map (kbd "C-g") 'evil-normal-state)
  (define-key yas-keymap (kbd "C-g") 'evil-normal-state)
  (yas-global-mode 1))

(use-package yasnippet-snippets)

(load (expand-file-name "snippets/yasnippet-scripts.el" user-emacs-directory))

(use-package perspective
  :ensure t
  :bind (("C-x k" . persp-kill-buffer*)
         ("C-x C-b" . consult-buffer))
  :custom
  (persp-mode-prefix-key (kbd "M-p"))
  :init
  (persp-mode))

(use-package avy
  :config
  (setq avy-all-windows 'all-frames)
  (global-set-key (kbd "C-:") 'avy-goto-char))

(defun efs/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(when (not (version< emacs-version "26.1"))
  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . efs/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-l")
    :config
    (lsp-enable-which-key-integration t)))

(when (not (version< emacs-version "26.1"))
  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom)))

; :hook (
                                        ; (org-mode TeX-mode LaTeX-mode typescript-mode
                                        ; maplev-mode c-mode c++-mode python-mode rustic-mode)
                                        ;. tree-sitter-hl-mode))

(when (fboundp 'module-load)
  (use-package tree-sitter
    :straight (tree-sitter :type git
                           :host github
                           :repo "ubolonton/emacs-tree-sitter"
                           :files ("lisp/*.el"))
    :hook ((latex-mode python-mode rustic-mode) . tree-sitter-hl-mode)
    :config
    (add-to-list 'tree-sitter-major-mode-language-alist '(rustic-mode . rust))
    (add-to-list 'tree-sitter-major-mode-language-alist '(TeX-mode . latex))
    (add-to-list 'tree-sitter-major-mode-language-alist '(LaTeX-mode . latex))
    (add-to-list 'tree-sitter-major-mode-language-alist '(latex-mode . latex))
    (add-to-list 'tree-sitter-major-mode-language-alist '(bibtex-mode . bibtex))
    (add-to-list 'tree-sitter-major-mode-language-alist '(org-mode . org))
    (add-to-list 'tree-sitter-major-mode-language-alist '(c-mode . c))
    (add-to-list 'tree-sitter-major-mode-language-alist '(cpp-mode . cpp))
    (add-to-list 'tree-sitter-major-mode-language-alist '(python-mode . python))
    (add-to-list 'tree-sitter-major-mode-language-alist '(typescript-mode . typescript))))

(when (fboundp 'module-load)
  (use-package tree-sitter-langs
    :straight (tree-sitter-langs :type git
                                 :host github
                                 :repo "ubolonton/emacs-tree-sitter"
                                 :files ("langs/*.el" "langs/queries"))
    :after tree-sitter))

(when (not (version< emacs-version "26.1"))
  (use-package treemacs
    :bind
    (:map global-map
          ([f4] . treemacs)
          ([f5] . treemacs-select-window))
    :config
    (setq treemacs-is-never-other-window t)))

(when (not (version< emacs-version "26.1"))
  (use-package treemacs-evil
    :after treemacs evil))

(when (not (version< emacs-version "26.1"))
  (use-package lsp-treemacs
    :after lsp))

(when (not (version< emacs-version "26.1"))
  (use-package dap-mode
                                        ; Uncomment the config below if you want all UI panes to be hidden by default!
                                        ; :custom
                                        ; (lsp-enable-dap-auto-configure nil)
                                        ; :config
                                        ; (dap-ui-mode 1)
    :commands dap-debug
    :config
                                        ; Set up Node debugging
    (require 'dap-node)
    (dap-node-setup) ; Automatically installs Node debug adapter if needed

                                        ; Bind `C-c l d` to `dap-hydra` for easy access
    (general-define-key
     :keymaps 'lsp-mode-map
     :prefix lsp-keymap-prefix
     "d" '(dap-hydra t :wk "debugger"))))

(use-package typescript-mode
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))

(add-hook 'c-mode-hook 'lsp)
(add-hook 'c++-mode-hook 'lsp)
