config.org
*** Latex

#+begin_src emacs-lisp

  (add-hook 'TeX-mode-hook 'lsp)
  (add-hook 'LaTeX-mode-hook 'lsp)

  (add-hook 'TeX-mode-hook 'turn-on-reftex)
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex)

  (add-hook 'TeX-mode-hook #'auto-fill-mode)
  (add-hook 'LaTeX-mode-hook #'auto-fill-mode)
  (setq-default fill-column 80)

  (add-hook 'TeX-mode-hook #'display-fill-column-indicator-mode)
  (add-hook 'LaTeX-mode-hook #'display-fill-column-indicator-mode)

  (when (not (version< emacs-version "26.1"))
    (use-package lsp-latex
      :bind (:map lsp-mode-map
                  ("C-l w r" . lsp-workspace-restart)
                  ("C-l w b" . lsp-latex-build))
      :config
                                          ; (setq lsp-completion-provider :none)
                                          ; (setq auto-complete-mode -1)
      (setq lsp-latex-build-executable "latexmk")
      (setq lsp-latex-build-args
            '("-pvc" "-pdf" "-interaction=nonstopmode" "-synctex=1" "-cd" "%f"))
      (setq lsp-latex-forward-search-after t)
      (setq lsp-latex-build-on-save t)
      (setq lsp-latex-forward-search-executable "zathura")
      (setq lsp-latex-forward-search-args '("--synctex-forward" "%l:1:%f" "%p"))))

  (defun get-bibtex-from-doi (doi)
    "Get a BibTeX entry from the DOI"
    (interactive "MDOI: ")
    (let ((url-mime-accept-string "text/bibliography;style=bibtex"))
      (with-current-buffer
          (url-retrieve-synchronously
           (format "http://dx.doi.org/%s"
                   (replace-regexp-in-string "http://dx.doi.org/" "" doi)))
        (switch-to-buffer (current-buffer))
        (goto-char (point-max))
        (setq bibtex-entry
              (buffer-substring
               (string-match "@" (buffer-string))
               (point)))
        (kill-buffer (current-buffer))))
    (insert (decode-coding-string bibtex-entry 'utf-8))
    (bibtex-fill-entry))

#+end_src

**** AUCTex setup

#+begin_src emacs-lisp

  (when (not (version< emacs-version "26.3"))
    (use-package tex
      :ensure auctex
      :config
      (setq TeX-auto-save t)
      (setq TeX-parse-self t)
      (setq-default TeX-master nil)
      (setq reftex-ref-macro-prompt nil)
      (setq font-latex-fontify-script nil)))

  (add-to-list 'auto-mode-alist '("\\.tex\\'" . LaTeX-mode))

#+end_src

*** Python

We use =lsp-mode= and =dap-mode= to provide a more complete development environment for Python in Emacs.  Check out [[https://emacs-lsp.github.io/lsp-mode/page/lsp-pyls/][the =pyls= configuration]] in the =lsp-mode= documentation for more details.

Make sure you have the =pyls= language server installed before trying =lsp-mode=!

#+begin_src sh :tangle no

  pip install --user "python-language-server[all]"

#+end_src

There are a number of other language servers for Python so if you find that =pyls= doesn't work for you, consult the =lsp-mode= [[https://emacs-lsp.github.io/lsp-mode/page/languages/][language configuration documentation]] to try the others!

#+begin_src emacs-lisp

  (use-package python-mode
    :ensure t
    :hook (python-mode . lsp-deferred)
    :custom
                                          ; NOTE: Set these if Python 3 is called "python3" on your system!
    (python-shell-interpreter "python3")
    (dap-python-executable "python3")
    (dap-python-debugger 'debugpy)
    :config
    (require 'dap-python)
    (setq python-indent-offset 2)
    (setq python-indent 2)
    (add-hook 'python-mode-hook
              (function (lambda ()
                          (setq indent-tabs-mode nil
                                tab-width 2)))))

#+end_src

You can use the pyvenv package to use =virtualenv= environments in Emacs.  The =pyvenv-activate= command should configure Emacs to cause =lsp-mode= and =dap-mode= to use the virtual environment when they are loaded, just select the path to your virtual environment before loading your project.

#+begin_src emacs-lisp

  (use-package pyvenv
    :after python-mode
    :config
    (pyvenv-mode 1))

#+end_src

*** Maple mode

#+begin_src emacs-lisp

  (use-package maplev
    :straight (maplev :type git
                      :host github
                      :repo "JoeRiel/maplev")
    :config
    (add-to-list 'auto-mode-alist '("\\.mpl\\'" . maplev-mode))
    (add-to-list 'auto-mode-alist '("\\.mm\\'" . maplev-mode)))

#+end_src

*** Mathematica mode

#+begin_src emacs-lisp

  (use-package wolfram-mode
    :config
    (setq wolfram-program "/usr/local/bin/MathKernel")
    (setq wolfram-path "~/.Mathematica")
    (add-to-list 'auto-mode-alist '("\\.m\\'" . wolfram-mode))
    (add-to-list 'auto-mode-alist '("\\.wl\\'" . wolfram-mode)))

#+end_src

*** TOML mode

#+begin_src emacs-lisp

  (use-package toml-mode)

#+end_src

*** Lean

#+begin_src emacs-lisp

  (use-package lean4-mode
    :straight (lean4-mode :type git :host github :repo "leanprover/lean4-mode")
                                          ; to defer loading the package until required
    :commands (lean4-mode))

#+end_src

*** Racket

#+begin_src emacs-lisp
                                          ;(use-package racket-mode)
  (setq scheme-program-name "/usr/bin/racket")
  (setq auto-mode-alist
        (cons '("\\.rkt\\'" . scheme-mode)
              auto-mode-alist))

  (defun run-scheme2 ()
    "Run scheme-program-name and disable geiser-mode."
    (interactive)
    (split-window-right)
    (geiser-mode -1)
    (windmove-right)
    (run-scheme scheme-program-name))

  (defun run-scheme3 ()
    "Run scheme-program-name and disable geiser-mode."
    (interactive)
    (split-window-right)
    (windmove-right)
    (run-scheme scheme-program-name))
#+end_src

*** Haskell

Install a language server to enable lsp. For example, [[https://formulae.brew.sh/formula/haskell-language-server][=brew install haskell-language-server=]].

#+begin_src emacs-lisp
  (use-package haskell-mode
    :mode "\\.hs\\'"
                                          ;:hook (haskell-mode . lsp-deferred)
    :config
    (setq haskell-program-name "/usr/bin/ghci")
    (add-hook 'haskell-mode-hook 'turn-on-haskell-doc-mode)
    ;; Choose indentation mode (the latter requires haskell-mode >= 2.5):
    (add-hook 'haskell-mode-hook 'turn-on-haskell-indent)
    ;;(add-hook 'haskell-mode-hook 'turn-on-haskell-indentation)
    )
  (use-package lsp-haskell)
#+end_src

** Company Mode

[[http://company-mode.github.io/][Company Mode]] provides a nicer in-buffer completion interface than =completion-at-point= which is more reminiscent of what you would expect from an IDE.  We add a simple configuration to make the keybindings a little more useful (=TAB= now completes the selection and initiates completion at the current location if needed).

We also use [[https://github.com/sebastiencs/company-box][company-box]] to further enhance the look of the completions with icons and better overall presentation.

#+begin_src emacs-lisp

  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :bind (:map company-active-map
                ("<tab>" . company-complete-selection))
    (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (when (not (version< emacs-version "26"))
    (use-package company-box
      :hook (company-mode . company-box-mode)))

#+end_src

** Magit

[[https://magit.vc/][Magit]] is the best Git interface I've ever used.  Common Git operations are easy to execute quickly using Magit's command panel system.

#+begin_src emacs-lisp

  (when (not (version< emacs-version "26.3"))
    (use-package magit
      :commands magit-status
      :custom
      (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)))

                                          ; NOTE: Make sure to configure a GitHub token before using this package!
                                          ; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
                                          ; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
  (when (not (version< emacs-version "26.3"))
    (use-package forge
      :after magit))

#+end_src

** Commenting

Emacs' built in commenting functionality =comment-dwim= (usually bound to =M-;=) doesn't always comment things in the way you might expect so we use [[https://github.com/redguardtoo/evil-nerd-commenter][evil-nerd-commenter]] to provide a more familiar behavior.  I've bound it to =M-/= since other editors sometimes use this binding but you could also replace Emacs' =M-;= binding with this command.

#+begin_src emacs-lisp

  (use-package evil-nerd-commenter
    :after evil
    :bind ("M-/" . evilnc-comment-or-uncomment-lines))

#+end_src

** Rainbow mode

#+begin_src emacs-lisp

  (when (not (version< emacs-version "26.3"))
    (use-package rainbow-mode))

#+end_src

** Rainbow delimiters

[[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] is useful in programming modes because it colorizes nested parentheses and brackets according to their nesting depth.  This makes it a lot easier to visually match parentheses in Emacs Lisp code without having to count them yourself.

#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

* Terminals
