init.el

(add-hook 'TeX-mode-hook 'lsp)
(add-hook 'LaTeX-mode-hook 'lsp)

(add-hook 'TeX-mode-hook 'turn-on-reftex)
(add-hook 'LaTeX-mode-hook 'turn-on-reftex)

(add-hook 'TeX-mode-hook #'auto-fill-mode)
(add-hook 'LaTeX-mode-hook #'auto-fill-mode)
(setq-default fill-column 80)

(add-hook 'TeX-mode-hook #'display-fill-column-indicator-mode)
(add-hook 'LaTeX-mode-hook #'display-fill-column-indicator-mode)

(when (not (version< emacs-version "26.1"))
  (use-package lsp-latex
    :bind (:map lsp-mode-map
                ("C-l w r" . lsp-workspace-restart)
                ("C-l w b" . lsp-latex-build))
    :config
                                        ; (setq lsp-completion-provider :none)
                                        ; (setq auto-complete-mode -1)
    (setq lsp-latex-build-executable "latexmk")
    (setq lsp-latex-build-args
          '("-pvc" "-pdf" "-interaction=nonstopmode" "-synctex=1" "-cd" "%f"))
    (setq lsp-latex-forward-search-after t)
    (setq lsp-latex-build-on-save t)
    (setq lsp-latex-forward-search-executable "zathura")
    (setq lsp-latex-forward-search-args '("--synctex-forward" "%l:1:%f" "%p"))))

(defun get-bibtex-from-doi (doi)
  "Get a BibTeX entry from the DOI"
  (interactive "MDOI: ")
  (let ((url-mime-accept-string "text/bibliography;style=bibtex"))
    (with-current-buffer
        (url-retrieve-synchronously
         (format "http://dx.doi.org/%s"
                 (replace-regexp-in-string "http://dx.doi.org/" "" doi)))
      (switch-to-buffer (current-buffer))
      (goto-char (point-max))
      (setq bibtex-entry
            (buffer-substring
             (string-match "@" (buffer-string))
             (point)))
      (kill-buffer (current-buffer))))
  (insert (decode-coding-string bibtex-entry 'utf-8))
  (bibtex-fill-entry))

(when (not (version< emacs-version "26.3"))
  (use-package tex
    :ensure auctex
    :config
    (setq TeX-auto-save t)
    (setq TeX-parse-self t)
    (setq-default TeX-master nil)
    (setq reftex-ref-macro-prompt nil)
    (setq font-latex-fontify-script nil)))

(add-to-list 'auto-mode-alist '("\\.tex\\'" . LaTeX-mode))

(use-package python-mode
  :ensure t
  :hook (python-mode . lsp-deferred)
  :custom
                                        ; NOTE: Set these if Python 3 is called "python3" on your system!
  (python-shell-interpreter "python3")
  (dap-python-executable "python3")
  (dap-python-debugger 'debugpy)
  :config
  (require 'dap-python)
  (setq python-indent-offset 2)
  (setq python-indent 2)
  (add-hook 'python-mode-hook
            (function (lambda ()
                        (setq indent-tabs-mode nil
                              tab-width 2)))))

(use-package pyvenv
  :after python-mode
  :config
  (pyvenv-mode 1))

(use-package maplev
  :straight (maplev :type git
                    :host github
                    :repo "JoeRiel/maplev")
  :config
  (add-to-list 'auto-mode-alist '("\\.mpl\\'" . maplev-mode))
  (add-to-list 'auto-mode-alist '("\\.mm\\'" . maplev-mode)))

(use-package wolfram-mode
  :config
  (setq wolfram-program "/usr/local/bin/MathKernel")
  (setq wolfram-path "~/.Mathematica")
  (add-to-list 'auto-mode-alist '("\\.m\\'" . wolfram-mode))
  (add-to-list 'auto-mode-alist '("\\.wl\\'" . wolfram-mode)))

(use-package toml-mode)

(use-package lean4-mode
  :straight (lean4-mode :type git :host github :repo "leanprover/lean4-mode")
                                        ; to defer loading the package until required
  :commands (lean4-mode))

;(use-package racket-mode)
(setq scheme-program-name "/usr/bin/racket")
(setq auto-mode-alist
      (cons '("\\.rkt\\'" . scheme-mode)
            auto-mode-alist))

(defun run-scheme2 ()
  "Run scheme-program-name and disable geiser-mode."
  (interactive)
  (split-window-right)
  (geiser-mode -1)
  (windmove-right)
  (run-scheme scheme-program-name))

(defun run-scheme3 ()
  "Run scheme-program-name and disable geiser-mode."
  (interactive)
  (split-window-right)
  (windmove-right)
  (run-scheme scheme-program-name))

(use-package haskell-mode
  :mode "\\.hs\\'"
                                        ;:hook (haskell-mode . lsp-deferred)
  :config
  (setq haskell-program-name "/usr/bin/ghci")
  (add-hook 'haskell-mode-hook 'turn-on-haskell-doc-mode)
  ;; Choose indentation mode (the latter requires haskell-mode >= 2.5):
  (add-hook 'haskell-mode-hook 'turn-on-haskell-indent)
  ;;(add-hook 'haskell-mode-hook 'turn-on-haskell-indentation)
  )
(use-package lsp-haskell)

(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
              ("<tab>" . company-complete-selection))
  (:map lsp-mode-map
        ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(when (not (version< emacs-version "26"))
  (use-package company-box
    :hook (company-mode . company-box-mode)))

(when (not (version< emacs-version "26.3"))
  (use-package magit
    :commands magit-status
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)))

                                        ; NOTE: Make sure to configure a GitHub token before using this package!
                                        ; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
                                        ; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
(when (not (version< emacs-version "26.3"))
  (use-package forge
    :after magit))

(use-package evil-nerd-commenter
  :after evil
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

(when (not (version< emacs-version "26.3"))
  (use-package rainbow-mode))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
