config.org
** Managing Mail with mu4e

It is necessary to install isync, setup a .mbsyncrc file like the following:

#+begin_src
IMAPAccount unm
Host outlook.office365.com
User jabelcastellanosjoo@unm.edu
AuthMechs XOAUTH2
PassCmd "~/.local/scripts/mail_scripts/mutt_oauth2.py ~/.local/scripts/mail_scripts/jabelcastellanosjoo@unm.edu.tokens"
Port 993
SSLType IMAPS
CertificateFile /etc/ssl/certs/ca-certificates.crt

IMAPStore unm-remote
Account unm

MaildirStore unm-local
Path ~/Mail/unm/
Inbox ~/Mail/unm/Inbox
SubFolders Verbatim

Channel unm
Far :unm-remote:
Near :unm-local:
Patterns *
Create Both
Expunge Both
SyncState *

IMAPAccount cs-unm
Host snape.cs.unm.edu
User jose.castellanosjoo@cs.unm.edu
AuthMechs Login
PassCmd "pass email/jose.castellanosjoo@cs.unm.edu"
Port 993
SSLType IMAPS
CertificateFile /etc/ssl/certs/ca-certificates.crt

IMAPStore cs-unm-remote
Account cs-unm

MaildirStore cs-unm-local
Path ~/Mail/cs-unm/
Inbox ~/Mail/cs-unm/Inbox
SubFolders Verbatim

Channel cs-unm
Far :cs-unm-remote:
Near :cs-unm-local:
Patterns *
Create Both
Expunge Both
SyncState *
#+end_src

Additionally, install mu using your package manager and set it up with the following:

#+begin_src

mu init --maildir=~/Mail --my-address=ADDRESS1 --my-address=ADDRESS2
mu index

#+end_src

mu4e comes included with mu. Search the path your package manager used to installed it and use it to change :load-path in the following block:

#+begin_src emacs-lisp

  (defvar efs/mu4e-path "/usr/share/emacs/site-lisp/mu4e/")

#+end_src

#+begin_src emacs-lisp

  (when (file-exists-p (concat efs/mu4e-path "mu4e.el"))
    (use-package mu4e
      :ensure nil
      :load-path (lambda () (expand-file-name efs/mu4e-path))
                                          ; :defer 20 ; Wait until 20 seconds after startup
      :config
      (require 'mu4e)
      (require 'mu4e-org)

                                          ; This is set to 't' to avoid mail syncing issues when using mbsync
      (setq mu4e-change-filenames-when-moving t)

                                          ; SMTP settings
      (setq sendmail-program "/usr/bin/msmtp"
            message-sendmail-f-is-evil t
            message-sendmail-extra-arguments '("--read-envelope-from")
            send-mail-function 'smtpmail-send-it
            message-send-mail-function 'message-send-mail-with-sendmail)

      (setq smtpmail-debug-info t)
      (setq starttls-use-gnutls t)

      (setq mu4e-update-interval 600)
      (setq mu4e-get-mail-command "mbsync -a")
      (setq mu4e-root-maildir "~/Mail")

                                          ; Just plain text
      (with-eval-after-load "mm-decode"
        (add-to-list 'mm-discouraged-alternatives "text/html")
        (add-to-list 'mm-discouraged-alternatives "text/richtext"))

      (defun jcs-view-in-eww (msg)
        (eww-browse-url (concat "file://" (mu4e~write-body-to-html msg))))
      (add-to-list 'mu4e-view-actions '("Eww view" . jcs-view-in-eww) t)

      (defun refile-func (msg)
        (cond
         ((mu4e-message-contact-field-matches msg :to "kapur@cs.unm.edu")
          "/unm/Prof. Kapur")
         ((mu4e-message-contact-field-matches msg :from "kapur@cs.unm.edu")
          "/unm/Prof. Kapur")
         ((mu4e-message-contact-field-matches msg :cc "kapur@cs.unm.edu")
          "/unm/Prof. Kapur")
         ((mu4e-message-contact-field-matches msg :to "kapur@unm.edu")
          "/unm/Prof. Kapur")
         ((mu4e-message-contact-field-matches msg :from "kapur@unm.edu")
          "/unm/Prof. Kapur")
         ((mu4e-message-contact-field-matches msg :cc "kapur@unm.edu")
          "/unm/Prof. Kapur")
         (t "/unm/Archive")))

      (setq mu4e-contexts
            (list
                                          ; School account
             (make-mu4e-context
              :name "School"
              :match-func
              (lambda (msg)
                (when msg
                  (string-prefix-p "/unm" (mu4e-message-field msg :maildir))))
              :vars '((user-mail-address  . "jabelcastellanosjoo@unm.edu")
                      (user-full-name     . "Jose Abel Castellanos Joo")
                      (mu4e-drafts-folder . "/unm/Drafts")
                      (mu4e-sent-folder   . "/unm/Sent")
                      (mu4e-refile-folder . refile-func)
                      (mu4e-trash-folder  . "/unm/Trash")
                      (smtpmail-smtp-server . "smtp.office365.com")
                      (smtpmail-smtp-service . 587)
                      (smtpmail-debug-info . t)
                      (smtpmail-stream-type . starttls)))
                                          ; School CS department account
             (make-mu4e-context
              :name "CS department"
              :match-func
              (lambda (msg)
                (when msg
                  (string-prefix-p "/cs-unm" (mu4e-message-field msg :maildir))))
              :vars '((user-mail-address  . "jose.castellanosjoo@cs.unm.edu")
                      (user-full-name     . "Jose Abel Castellanos Joo")
                      (mu4e-drafts-folder . "/cs-unm/Drafts")
                                          ;(mu4e-sent-folder   . "/cs-unm/Sent")
                      (mu4e-refile-folder . "/cs-unm/Inbox")
                      (mu4e-trash-folder  . "/cs-unm/Trash")
                      (smtpmail-smtp-server . "snape.cs.unm.edu")
                      (smtpmail-smtp-service . 1200)
                      (smtpmail-stream-type . starttls)))))

      (setq mu4e-context-policy 'pick-first)

      (setq mu4e-maildir-shortcuts
            '(("/unm/Inbox" . ?i)
              ("/unm/Sent"  . ?s)
              ("/unm/Trash" . ?t)
              ("/unm/Drafts". ?d)
              ("/unm/Prof. Kapur". ?k)
              ("/unm/Prof. Kapur/Side projects/Seminars/Beihang University". ?b)
              ("/unm/Prof. Kapur/Side projects/MaxDiff Extension". ?m)
              ("/unm/TA Work/CS 357". ?c)
              ("/unm/You got a Package!". ?p)
              ("/unm/Archive". ?a)
              ("/cs-unm/Inbox". ?I)
              ("/cs-unm/Trash". ?T)
              ("/cs-unm/Drafts". ?D)))))

                                          ; UX settings
  (setq mu4e-use-fancy-chars t)
  (setq mu4e-attachment-dir  "~/tosend")
  (setq mu4e-headers-show-threads nil)
  (setq mu4e-confirm-quit nil)
  (setq mu4e-headers-results-limit -1)
  (setq mu4e-compose-signature "Best,\nJose")
  (setq message-citation-line-format "On %d %b %Y at %R, %f wrote:\n")
  (setq message-citation-line-function 'message-insert-formatted-citation-line)
  (setq
                                          ; Display
   mu4e-view-show-addresses t
   mu4e-view-show-images t
   mu4e-view-image-max-width 800
   mu4e-hide-index-messages t)

  (use-package org-mime
    :ensure t)

  (load (expand-file-name "scripts/mu4e-view-save-all-attachments.el" user-emacs-directory))
#+end_src

